KitSprout/QCopterFlightControl/Software/TEST_QCopterFC_IAP/Program/Dirvers/stm32f4_iap.c
/*====================================================================================================*/
/*====================================================================================================*/
#include "stm32f4_system.h"
#include "stm32f4_flash.h"
#include "stm32f4_iap.h"
#include "experiment_stm32f4.h"
#include "module_rs232.h"
/*====================================================================================================*/
/*====================================================================================================*/
#define RecvCodeSize 1024

static u8 RecvBuf[RecvCodeSize] = {0};
/*====================================================================================================*/
/*====================================================================================================*
**函數 : IAP_Init
**功能 : IAP 初始化
**輸入 : None
**輸出 : None
**使用 : IAP_Init();
**====================================================================================================*/
/*====================================================================================================*/
void IAP_Init( void )
{
  RS232_Config();
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : IAP_Download
**功能 : IAP Download Binary Code
**輸入 : None
**輸出 : None
**使用 : IAP_Download();
**====================================================================================================*/
/*====================================================================================================*/
void IAP_Download( void )
{
  u32 i = 0;
  u32 CodeSize = 0;
  u32 TempSize = 0;

  LED_G = 0;
  RS232_RecvData((u8*)RecvBuf, 4);
  CodeSize = (RecvBuf[0]<<24) | (RecvBuf[1]<<16) | (RecvBuf[2]<<8) | (RecvBuf[3]);

  Flash_EraseSectors(Flash_GetSector(IAP_APP_ADDR), Flash_GetSector(IAP_APP_ADDR + CodeSize));

  RS232_SendData((u8*)RecvBuf, 4);
  RS232_RecvData((u8*)RecvBuf, 1);
  TempSize = CodeSize;

  if(RecvBuf[0] == 0xF0) {
    while(TempSize) {
      LED_G = !LED_G;
      if(TempSize>=RecvCodeSize) {
        RS232_RecvData(RecvBuf, RecvCodeSize);
        Flash_WriteDataU8(IAP_APP_ADDR+i, RecvBuf, RecvCodeSize);
        Flash_ReadDataU8(IAP_APP_ADDR+i,  RecvBuf, RecvCodeSize);
        RS232_SendData(RecvBuf, RecvCodeSize);
        i += RecvCodeSize;
        TempSize -= RecvCodeSize;
      }
      else {
        RS232_RecvData(RecvBuf, TempSize);
        if(TempSize%2 != 0)
          RecvBuf[CodeSize-TempSize] = 0;
        Flash_WriteDataU8(IAP_APP_ADDR+i, RecvBuf, TempSize);
        Flash_ReadDataU8(IAP_APP_ADDR+i,  RecvBuf, TempSize);
        RS232_SendData(RecvBuf, TempSize);
        TempSize = 0;
      }
    }
  }
  else {
    LED_R = 0;
  }
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : IAP_JumpToApp
**功能 : 執行載入程式
**輸入 : None
**輸出 : None
**使用 : IAP_JumpToApp();
**====================================================================================================*/
/*====================================================================================================*/
void IAP_JumpToApp( void )
{
  u32 JumpAddr;
  void (*JumpToApp)(void);

  JumpAddr = *(vu32*)(IAP_APP_ADDR + 4);
  JumpToApp = (void (*)(void))JumpAddr;
  __set_MSP(*(vu32*)IAP_APP_ADDR);
  JumpToApp();
}
/*====================================================================================================*/
/*====================================================================================================*
**函數 : IAP_SetVectorTable
**功能 : 重新設定向量表
**輸入 : Offset
**輸出 : None
**使用 : IAP_SetVectorTable(IAP_FLASH_SIZE);
**====================================================================================================*/
/*====================================================================================================*/
//void IAP_SetVectorTable( u32 Offset )
//{
//  SCB->VTOR = (u32)(IAP_BOOT_ADDR | (Offset & (u32)0x1FFFFF80));
//}
/*====================================================================================================*/
/*====================================================================================================*/
